# 如何在用户输入用户名或密码错我的时候重新输入？
# 如何实现扑克牌的持续发牌？
# 都要用到循环

###########python当中的for循环#############
# python中的for循环，实现的机制是使用一个变量来遍历指定的序列内容
# 序列可以是列表，一个数字范围，一个字符串
# 什么叫遍历呢？我们可以理解为挨个点名
# 假设我们有一个54个元素内容的列表，用变量i去对该列表的内容挨个点名
# 当列表中的所有元素都被点过名狗，这个循环就结束了
############################################

# ============================================================================================================
# 实例 ：
# poker = ['黑桃1','黑桃2','黑桃3','黑桃4','黑桃5','黑桃6','黑桃7','黑桃8','黑桃9','黑桃10','黑桃J','黑桃Q','黑桃K'
#          '红桃1','红桃2','红桃3','红桃4','红桃5','红桃6','红桃7','红桃8','红桃9','红桃10','红桃J','红桃Q','红桃K'
#          '梅花1','梅花2','梅花3','梅花4','梅花5','梅花6','梅花7','梅花8','梅花9','梅花10','梅花J','梅花Q','梅花K'
#          '方块1','方块2','方块3','方块4','方块5','方块6','方块7','方块8','方块9','方块10','方块J','方块Q','方块K']
# import random
# random.choice(poker) #shuffle()函数用来随机打乱列表顺序
# for i in  poker:   #让变量i遍历poker这个列表内容，每次遍历的时候，i都被赋值为poker列表中当前被颠倒的人的名字
#      print(i)        #输出查看当前点到谁的名字
#      if i == "红桃1":
#          print('哈哈哈哈哈哈哈哈')
# =============================================================================================================

# ================================================================================================
# for i in '今天天气不错':
#     print(i)
# ================================================================================================

# ============这是我们平时上网时，用来筛选文明用语的最根本的机制==============
# 小练习：
# 让用户输出一句话，并将这个字符串赋值给变量abc
# 循环判断abc变量中存储的字符内是否有f这个字母
# 如果有，则打印输出‘找到f词，违规！’

# abc = input('请输入：')
# for i in abc:
#     if i == 'f':
#         print('找到f词，违规！！')
# ===========================================================================

# for i in range(100):    #用数字范围作为序列来循环，range(100)表示数字范围在0-99之间
#     print(i)            #每次循环打印输出当前i遍历到的数字

# 我能不能让for循环一直循环下去呢？
# for循环在python当中无法实现无限循环
# 想要实现无限循环，需要用到while

###################while循环############################
# while叫做当....时
# 当条件被满足的时候，就循环做什么事情

# ===========================================
# a = 10 #设定变量a的值为10
# # 用a的数字作为判断条件来写一个while循环
# while a > 0:    #当a的值大于0时
#     print('A大于0')   #输出内容
# ===========================================

# 在上面这个实例中，我们发现因为给a设置了数值10，她永远大于0这个数字
# 所以这个while循环停不下来了，也就实现了无限循环（死循环）
# 我们如何让他停下来的？
# a = 10
# while a > 0:
#     print(a)
#     a -= 1

############break关键字#################
# a = 10
# while a > 0:
#     print(a)
#     a -= 1
#     if a == 5:      #当a等于5时
#         break       #终止循环

###########continue############
# a = 10
# while a > 0:
#     a -= 1
#     if a == 5:
#         continue    #跳过continue之后的内容，直接进入下一次循环
#     print(a)

# while循环中也可以使用else
# a = 1
# while a > 5:
#     print(a)
# else:
#     print('太小了，他的数值是',a)

# =================================================================================
# 升级版石头剪刀布1.1
# 1.完善了玩家注册和登录的程序，当玩家输入有误的时候，可以重新输入，不在需要重新执行程序
# 2.玩家进入游戏后，默认获得5次游戏次数，每次猜拳五轮输赢或输入错误，都消耗一次游戏机会
# 3.玩家胜利时，不消耗本轮游戏机会
# 4.记录玩家连胜次数，当连胜次数到达5次时，奖励一次游戏机会
# 5.玩家每次胜利获得1金币，当玩家游戏次数小于两次时，会提示玩家是否购买游戏机会（5金币一次）
# 6.玩家每次胜利可获得经验值，当经验值达到要求，等级提升，经验值清零


# ===========================================================================================================
# uname = ""
# upwd = ""
# upwdretype = ""
# useract = input('请输入登录/注册（按Q退出）：')
# while useract != 'Q':
#     if useract == '登录':
#         login = {'用户名':'aaa','密码':'bbb'}
#         uname = input('请输入用户名：')
#         if uname == login['用户名']:
#             upwd = input('请输入密码：')
#             if upwd == login['密码']:
#                 print('登录成功！')
#                 a = 5   #游戏次数
#                 ls = 0  #连胜
#                 s = 0   #金币数量
#                 ex = 0  #经验数量
#                 lv = 0  #等级
#                 while a < 6 and a > 0:
#                     print('=======================')
#                     print('我们来玩个小游戏')
#                     print("您的等级为", lv, "级")
#                     print("您的经验值为", ex)
#                     print("您剩余", a , "次机会")
#                     print("您持有金币数量为", s)
#                     # 设置要求，连胜次数5次以上，添加
#                     if ls >= 5:
#                         ls -= 5
#                         a += 1
#                         print("达成5连胜", "连胜增加一次挑战机会")
#                     if a <= 2:
#                         print("游戏机会剩余", a, "次，是否花费5金币购买挑战机会y/n")
#                         temp = input("y/n")
#                         if temp == 'y' or temp == 'Y':
#                             if s >= 5:
#                                 s -= 5
#                                 a += 1
#                             else:
#                                 print("金币数量为", s, "余额不足！")
#                     import random
#                     ran = random.randint(1, 3)
#                     print('电脑出的是：', ran)
#                     play = int(input('请出石头（1）,剪刀（2），布（3）'))
#                     if ((play == 1 and ran == 2) or
#                             (play == 2 and ran == 3) or
#                             (play == 3 and ran == 1)):
#                         ls += 1
#                         s += 1
#                         ex += random.randrange(10,20)
#                         if ex >= 50:
#                             lv += 1
#                             ex = 0
#                             print('恭喜你，升到' ,lv ,'级了')
#                         print('恭喜你，你赢了')
#                         print('剩余机会：', a)
#                     elif play == ran:
#                         print('平局')
#                         a = a - 1
#                         ls = 0
#                         print('剩余机会：', a)
#                     elif ((play == 2 and ran == 1) or
#                           (play == 3 and ran == 2) or
#                           (play == 1 and ran == 3)):
#                         print('很遗憾，你输了')
#                         a = a - 1
#                         print('剩余机会：', a)
#                     else:
#                         print('您的输入有误！')
#                         a = a - 1
#                         print('剩余机会：', a)
#             else:
#                 print('密码错误！')
#         else:
#             print('没有该用户，您输入的用户名有误！')
#     elif useract == '注册':
#         uname = input("请输入您的用户名：")
#         if uname.isalnum() or uname.isalpha() or uname.isdigit():
#             user = []
#             user.append(uname)
#             upwd = input("请输入密码：")
#             upwdretype = input("请再次输入密码：")
#             if upwd == upwdretype:
#                 pwd = []
#                 pwd.append(upwd)
#                 print('注册成功！')
#                 print('用户名：',user[0],'密码：',pwd[0])
#             else:
#                 print('两次输入的密码不同！')
#         else:
#             print("您的用户名含有特殊字符！")
#     else:
#         useract = input('请输入登录/注册（按Q退出）：')
#     useract = input('请输入登录/注册（按Q退出）：')
# else:
#     print('程序已退出')
#
#
# a = 5
# while a < 6 and a > 0:
#     print('=======================')
#     print('我们来玩个小游戏')
#     play = int(input('请出石头（1）,剪刀（2），布（3）'))
#     import random
#     ran = random.randint(1, 3)
#     print('电脑出的是：', ran)
#     if ((play == 1 and ran == 2) or
#             (play == 2 and ran == 3) or
#             (play == 3 and ran == 1)):
#         print('恭喜你，你赢了')
#         print('剩余机会：', a)
#     elif play == ran:
#         print('平局')
#         a = a - 1
#         print('剩余机会：', a)
#     elif ((play == 2 and ran == 1) or
#           (play == 3 and ran == 2) or
#           (play == 1 and ran == 3)):
#         print('很遗憾，你输了')
#         a = a - 1
#         print('剩余机会：', a)
#     else:
#         print('您的输入有误！')
#         a = a - 1
#         print('剩余机会：', a)
#
# ===========================================================================================================


